app/views/homes/index.html.erb

  <% if @user.admin? %>
    <p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>
---
SELECT COUNT(*) FROM `users`